[Economy.Economy_BuyItemsWithEridium:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Purchase 2 items with Eridium"

[Economy.Economy_BuyItemsWithEridium:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Purchase 5 items with Eridium"

[Economy.Economy_BuyItemsWithEridium:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Purchase 9 items with Eridium"

[Economy.Economy_BuyItemsWithEridium:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Purchase 14 items with Eridium"

[Economy.Economy_BuyItemsWithEridium:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Purchase 20 items with Eridium"

[Economy.Economy_EarnDollarsFromSellingItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Earn 4,500 dollars from selling items"

[Economy.Economy_EarnDollarsFromSellingItems:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Earn 25,000 dollars from selling items"

[Economy.Economy_EarnDollarsFromSellingItems:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Earn 80,000 dollars from selling items"

[Economy.Economy_EarnDollarsFromSellingItems:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Earn 300,000 dollars from selling items"

[Economy.Economy_EarnDollarsFromSellingItems:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Earn 1,000,000 dollars from selling items"

[Economy.Economy_MoneySaved:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Reach 10,000 dollars in savings"

[Economy.Economy_MoneySaved:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Reach 50,000 dollars in savings"

[Economy.Economy_MoneySaved:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Reach 250,000 dollars in savings"

[Economy.Economy_MoneySaved:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Reach 1,000,000 dollars in savings"

[Economy.Economy_MoneySaved:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Reach 5,000,000 dollars in savings"

[Economy.Economy_PurchaseItemsOfTheDay:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Purchase 1 Item of the Day from vending machines"

[Economy.Economy_PurchaseItemsOfTheDay:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Purchase 5 Items of the Day from vending machines"

[Economy.Economy_PurchaseItemsOfTheDay:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Purchase 15 Items of the Day from vending machines"

[Economy.Economy_PurchaseItemsOfTheDay:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Purchase 30 Items of the Day from vending machines"

[Economy.Economy_PurchaseItemsOfTheDay:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Purchase 50 Items of the Day from vending machines"

[Economy.Economy_SellItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Sell 10 items"

[Economy.Economy_SellItems:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Sell 25 items"

[Economy.Economy_SellItems:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Sell 150 items"

[Economy.Economy_SellItems:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Sell 300 items"

[Economy.Economy_SellItems:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Sell 750 items"

[Economy.Trade_ItemsWithPlayers:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Trade with another player"

[Economy.Trade_ItemsWithPlayers:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Trade with another player 5 times"

[Economy.Trade_ItemsWithPlayers:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Trade with another player 15 times"

[Economy.Trade_ItemsWithPlayers:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Trade with another player 30 times"

[Economy.Trade_ItemsWithPlayers:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Trade with another player 50 times"

[Elemental.Elemental_DealBonusSlagDamage ChallengeDefinition]
Description="Deal bonus damage to slagged enemies."

[Elemental.Elemental_DealBonusSlagDamage:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Deal 5,000 points of slag bonus damage"

[Elemental.Elemental_DealBonusSlagDamage:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Deal 25,000 points of slag bonus damage"

[Elemental.Elemental_DealBonusSlagDamage:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Deal 150,000 points of slag bonus damage"

[Elemental.Elemental_DealBonusSlagDamage:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Deal 1,000,000 points of slag bonus damage"

[Elemental.Elemental_DealBonusSlagDamage:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Deal 5,000,000 points of slag bonus damage"

[Elemental.Elemental_DealCorrosiveDOTDamage ChallengeDefinition]
Description="Deal damage with corrosive DoT (damage-over-time) effects."

[Elemental.Elemental_DealCorrosiveDOTDamage:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Deal 2,500 points of Corrode damage"

[Elemental.Elemental_DealCorrosiveDOTDamage:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Deal 20,000 points of Corrode damage"

[Elemental.Elemental_DealCorrosiveDOTDamage:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Deal 100,000 points of Corrode damage"

[Elemental.Elemental_DealCorrosiveDOTDamage:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Deal 500,000 points of Corrode damage"

[Elemental.Elemental_DealCorrosiveDOTDamage:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Deal 1,000,000 points of Corrode damage"

[Elemental.Elemental_DealFireDOTDamage ChallengeDefinition]
Description="Deal damage with incendiary DoT (damage-over-time) effects."

[Elemental.Elemental_DealFireDOTDamage:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Deal 5,000 points of Burn damage"

[Elemental.Elemental_DealFireDOTDamage:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Deal 20,000 points of Burn damage"

[Elemental.Elemental_DealFireDOTDamage:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Deal 100,000 points of Burn damage"

[Elemental.Elemental_DealFireDOTDamage:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Deal 500,000 points of Burn damage"

[Elemental.Elemental_DealFireDOTDamage:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Deal 1,000,000 points of Burn damage"

[Elemental.Elemental_DealShockDOTDamage ChallengeDefinition]
ChallengeName="Say ''Watt'' Again"
Description="Deal damage with shock DoT (damage-over-time) effects."

[Elemental.Elemental_DealShockDOTDamage:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Deal 5,000 points of Electrocute damage"

[Elemental.Elemental_DealShockDOTDamage:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Deal 20,000 points of Electrocute damage"

[Elemental.Elemental_DealShockDOTDamage:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Deal 100,000 points of Electrocute damage"

[Elemental.Elemental_DealShockDOTDamage:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Deal 500,000 points of Electrocute damage"

[Elemental.Elemental_DealShockDOTDamage:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Deal 1,000,000 points of Electrocute damage"

[Elemental.Elemental_KillEnemiesCorrosive ChallengeDefinition]
ChallengeName="Acid Trip"
Description="Kill enemies with corrosive damage."

[Elemental.Elemental_KillEnemiesCorrosive:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 20 enemies with corrosive damage"

[Elemental.Elemental_KillEnemiesCorrosive:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 75 enemies with corrosive damage"

[Elemental.Elemental_KillEnemiesCorrosive:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 250 enemies with corrosive damage"

[Elemental.Elemental_KillEnemiesCorrosive:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 600 enemies with corrosive damage"

[Elemental.Elemental_KillEnemiesCorrosive:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 1,000 enemies with corrosive damage"

[Elemental.Elemental_KillEnemiesExplosive:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 20 enemies with explosive damage"

[Elemental.Elemental_KillEnemiesExplosive:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 75 enemies with explosive damage"

[Elemental.Elemental_KillEnemiesExplosive:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 250 enemies with explosive damage"

[Elemental.Elemental_KillEnemiesExplosive:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 600 enemies with explosive damage"

[Elemental.Elemental_KillEnemiesExplosive:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 1,000 enemies with explosive damage"

[Elemental.Elemental_KillSlaggedEnemies ChallengeDefinition]
Description="Kill enemies who are slagged."

[Elemental.Elemental_KillSlaggedEnemies:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 slagged enemies"

[Elemental.Elemental_KillSlaggedEnemies:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 slagged enemies"

[Elemental.Elemental_KillSlaggedEnemies:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 150 slagged enemies"

[Elemental.Elemental_KillSlaggedEnemies:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 300 slagged enemies"

[Elemental.Elemental_KillSlaggedEnemies:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 750 slagged enemies"

[Elemental.Elemental_SetEnemiesOnFire ChallengeDefinition]
Description="Light enemies on fire."

[Elemental.Elemental_SetEnemiesOnFire:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Ignite 25 enemies"

[Elemental.Elemental_SetEnemiesOnFire:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Ignite 100 enemies"

[Elemental.Elemental_SetEnemiesOnFire:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Ignite 400 enemies"

[Elemental.Elemental_SetEnemiesOnFire:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Ignite 1,000 enemies"

[Elemental.Elemental_SetEnemiesOnFire:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Ignite 2,000 enemies"

[enemies.Enemies_KillBruisers:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 bruisers"

[enemies.Enemies_KillBruisers:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 bruisers"

[enemies.Enemies_KillBruisers:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 bruisers"

[enemies.Enemies_KillBruisers:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 bruisers"

[enemies.Enemies_KillBruisers:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 bruisers"

[enemies.Enemies_KillBullymongs:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 25 bullymongs"

[enemies.Enemies_KillBullymongs:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 50 bullymongs"

[enemies.Enemies_KillBullymongs:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 150 bullymongs"

[enemies.Enemies_KillBullymongs:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 300 bullymongs"

[enemies.Enemies_KillBullymongs:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 750 bullymongs"

[enemies.Enemies_KillConstructors:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 constructors"

[enemies.Enemies_KillConstructors:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 12 constructors"

[enemies.Enemies_KillConstructors:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 20 constructors"

[enemies.Enemies_KillConstructors:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 30 constructors"

[enemies.Enemies_KillConstructors:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 50 constructors"

[enemies.Enemies_KillCrystalisks:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 crystalisks"

[enemies.Enemies_KillCrystalisks:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 crystalisks"

[enemies.Enemies_KillCrystalisks:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 50 crystalisks"

[enemies.Enemies_KillCrystalisks:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 80 crystalisks"

[enemies.Enemies_KillCrystalisks:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 120 crystalisks"

[enemies.Enemies_KillGoliaths:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 goliaths"

[enemies.Enemies_KillGoliaths:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 goliaths"

[enemies.Enemies_KillGoliaths:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 50 goliaths"

[enemies.Enemies_KillGoliaths:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 80 goliaths"

[enemies.Enemies_KillGoliaths:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 120 goliaths"

[enemies.Enemies_KillLoaders:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 20 loaders"

[enemies.Enemies_KillLoaders:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 100 loaders"

[enemies.Enemies_KillLoaders:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 500 loaders"

[enemies.Enemies_KillLoaders:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 1,000 loaders"

[enemies.Enemies_KillLoaders:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 1,500 loaders"

[enemies.Enemies_KillMarauders ChallengeDefinition]
ChallengeName="Marauder? I Hardly Know 'Er!"

[enemies.Enemies_KillMarauders:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 20 marauders"

[enemies.Enemies_KillMarauders:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 100 marauders"

[enemies.Enemies_KillMarauders:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 500 marauders"

[enemies.Enemies_KillMarauders:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 1,000 marauders"

[enemies.Enemies_KillMarauders:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 1,500 marauders"

[enemies.Enemies_KillMidgets:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 midgets"

[enemies.Enemies_KillMidgets:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 midgets"

[enemies.Enemies_KillMidgets:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 midgets"

[enemies.Enemies_KillMidgets:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 midgets"

[enemies.Enemies_KillMidgets:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 midgets"

[enemies.Enemies_KillNomads:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 nomads"

[enemies.Enemies_KillNomads:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 nomads"

[enemies.Enemies_KillNomads:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 nomads"

[enemies.Enemies_KillNomads:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 nomads"

[enemies.Enemies_KillNomads:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 nomads"

[enemies.Enemies_KillPsychos:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 50 psychos"

[enemies.Enemies_KillPsychos:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 100 psychos"

[enemies.Enemies_KillPsychos:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 150 psychos"

[enemies.Enemies_KillPsychos:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 300 psychos"

[enemies.Enemies_KillPsychos:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 500 psychos"

[enemies.Enemies_KillRats:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 rats"

[enemies.Enemies_KillRats:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 rats"

[enemies.Enemies_KillRats:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 rats"

[enemies.Enemies_KillRats:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 rats"

[enemies.Enemies_KillRats:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 rats"

[enemies.Enemies_KillSkags:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 skags"

[enemies.Enemies_KillSkags:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 skags"

[enemies.Enemies_KillSkags:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 skags"

[enemies.Enemies_KillSkags:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 skags"

[enemies.Enemies_KillSkags:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 skags"

[enemies.Enemies_KillSpiderants:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 spiderants"

[enemies.Enemies_KillSpiderants:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 spiderants"

[enemies.Enemies_KillSpiderants:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 spiderants"

[enemies.Enemies_KillSpiderants:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 spiderants"

[enemies.Enemies_KillSpiderants:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 spiderants"

[enemies.Enemies_KillStalkers:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 stalkers"

[enemies.Enemies_KillStalkers:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 stalkers"

[enemies.Enemies_KillStalkers:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 stalkers"

[enemies.Enemies_KillStalkers:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 stalkers"

[enemies.Enemies_KillStalkers:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 stalkers"

[enemies.Enemies_KillSurveyors:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 surveyors"

[enemies.Enemies_KillSurveyors:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 surveyors"

[enemies.Enemies_KillSurveyors:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 surveyors"

[enemies.Enemies_KillSurveyors:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 surveyors"

[enemies.Enemies_KillSurveyors:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 surveyors"

[enemies.Enemies_KillThreshers:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 threshers"

[enemies.Enemies_KillThreshers:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 threshers"

[enemies.Enemies_KillThreshers:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 threshers"

[enemies.Enemies_KillThreshers:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 threshers"

[enemies.Enemies_KillThreshers:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 threshers"
[enemies.Enemies_KillVarkid:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 varkids"

[enemies.Enemies_KillVarkid:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 varkids"

[enemies.Enemies_KillVarkid:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 varkids"

[enemies.Enemies_KillVarkid:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 varkids"

[enemies.Enemies_KillVarkid:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 varkids"

[enemies.Enemies_KillVarkidPods ChallengeDefinition]
Description="Kill varkid pods before they hatch."

[enemies.Enemies_KillVarkidPods:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 varkid pods before they hatch"

[enemies.Enemies_KillVarkidPods:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 varkid pods before they hatch"

[enemies.Enemies_KillVarkidPods:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 45 varkid pods before they hatch"

[enemies.Enemies_KillVarkidPods:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 70 varkid pods before they hatch"

[enemies.Enemies_KillVarkidPods:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 100 varkid pods before they hatch"

[enemies.Enemies_ReleaseChainedMidgets:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Free a midget from a nomad shield"

[enemies.Enemies_ReleaseChainedMidgets:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Free 5 midgets from nomad shields"

[enemies.Enemies_ReleaseChainedMidgets:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Free 15 midgets from nomad shields"

[enemies.Enemies_ReleaseChainedMidgets:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Free 30 midgets from nomad shields"

[enemies.Enemies_ReleaseChainedMidgets:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Free 50 midgets from nomad shields"

[enemies.Enemies_ShootBullymongProjectiles ChallengeDefinition]
Description="Shoot bullymong-tossed projectiles out of mid air."

[enemies.Enemies_ShootBullymongProjectiles:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Shoot 10 bullymong-tossed projectiles"

[enemies.Enemies_ShootBullymongProjectiles:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Shoot 25 bullymong-tossed projectiles"

[enemies.Enemies_ShootBullymongProjectiles:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Shoot 50 bullymong-tossed projectiles"

[enemies.Enemies_ShootBullymongProjectiles:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Shoot 125 bullymong-tossed projectiles"

[enemies.Enemies_ShootBullymongProjectiles:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Shoot 250 bullymong-tossed projectiles"

[GeneralCombat.Barrels_KillEnemies:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies by using stationary barrels"

[GeneralCombat.Barrels_KillEnemies:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies by using stationary barrels"

[GeneralCombat.Barrels_KillEnemies:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 45 enemies by using stationary barrels"

[GeneralCombat.Barrels_KillEnemies:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 70 enemies by using stationary barrels"

[GeneralCombat.Barrels_KillEnemies:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 100 enemies by using stationary barrels"

[GeneralCombat.Kills_AtDay:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 50 enemies during the daytime"

[GeneralCombat.Kills_AtDay:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 250 enemies during the daytime"

[GeneralCombat.Kills_AtDay:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 1,000 enemies during the daytime"

[GeneralCombat.Kills_AtDay:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 2,500 enemies during the daytime"

[GeneralCombat.Kills_AtDay:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 5,000 enemies during the daytime"

[GeneralCombat.Kills_Gibs ChallengeDefinition]
Description="Get gib kills."

[GeneralCombat.Plants_KillEnemies ChallengeDefinition]
Description="Kill enemies using Pandora's plant life."

[GeneralCombat.Plants_KillEnemies:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies using Pandora's plant life"

[GeneralCombat.Plants_KillEnemies:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies using Pandora's plant life"

[GeneralCombat.Plants_KillEnemies:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 45 enemies using Pandora's plant life"

[GeneralCombat.Plants_KillEnemies:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 70 enemies using Pandora's plant life"

[GeneralCombat.Plants_KillEnemies:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 100 enemies using Pandora's plant life"

[GeneralCombat.Player_KillsWithActionSkill:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 20 enemies while using your Action Skill"

[GeneralCombat.Player_KillsWithActionSkill:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 75 enemies while using your Action Skill"

[GeneralCombat.Player_KillsWithActionSkill:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 250 enemies while using your Action Skill"

[GeneralCombat.Player_KillsWithActionSkill:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 600 enemies while using your Action Skill"

[GeneralCombat.Player_KillsWithActionSkill:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 1,000 enemies while using your Action Skill"

[GeneralCombat.Tediore_DamageFromReloads:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Deal 5,000 damage with Tediore reloads"

[GeneralCombat.Tediore_DamageFromReloads:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Deal 20,000 damage with Tediore reloads"

[GeneralCombat.Tediore_DamageFromReloads:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Deal 100,000 damage with Tediore reloads"

[GeneralCombat.Tediore_DamageFromReloads:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Deal 500,000 damage with Tediore reloads"

[GeneralCombat.Tediore_DamageFromReloads:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Deal 1,000,000 damage with Tediore reloads"

[GeneralCombat.Tediore_KillWithReload:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Use Tediore reloads to kill 5 enemies"

[GeneralCombat.Tediore_KillWithReload:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Use Tediore reloads to kill 10 enemies"

[GeneralCombat.Tediore_KillWithReload:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Use Tediore reloads to kill 50 enemies"

[GeneralCombat.Tediore_KillWithReload:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Use Tediore reloads to kill 100 enemies"

[GeneralCombat.Tediore_KillWithReload:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Use Tediore reloads to kill 200 enemies"

[Grenades.Grenade_KillsBouncing:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies using Bouncing Betty grenades"

[Grenades.Grenade_KillsBouncing:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies using Bouncing Betty grenades"

[Grenades.Grenade_KillsBouncing:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 enemies using Bouncing Betty grenades"

[Grenades.Grenade_KillsBouncing:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 enemies using Bouncing Betty grenades"

[Grenades.Grenade_KillsBouncing:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 enemies using Bouncing Betty grenades"

[Grenades.Grenade_KillsMirvType ChallengeDefinition]
Description="Kill enemies with MIRV grenades."

[Grenades.Grenade_KillsMirvType:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies with MIRV grenades"

[Grenades.Grenade_KillsMirvType:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies with MIRV grenades"

[Grenades.Grenade_KillsMirvType:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 enemies with MIRV grenades"

[Grenades.Grenade_KillsMirvType:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 enemies with MIRV grenades"

[Grenades.Grenade_KillsMirvType:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 enemies with MIRV grenades"

[Grenades.Grenade_KillsSingularityType:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies with Singularity grenades"

[Grenades.Grenade_KillsSingularityType:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies with Singularity grenades"

[Grenades.Grenade_KillsSingularityType:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 enemies with Singularity grenades"

[Grenades.Grenade_KillsSingularityType:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 enemies with Singularity grenades"

[Grenades.Grenade_KillsSingularityType:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 enemies with Singularity grenades"

[Grenades.Grenade_KillsTransfusionType:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies with Transfusion grenades"

[Grenades.Grenade_KillsTransfusionType:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies with Transfusion grenades"

[Grenades.Grenade_KillsTransfusionType:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 75 enemies with Transfusion grenades"

[Grenades.Grenade_KillsTransfusionType:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 150 enemies with Transfusion grenades"

[Grenades.Grenade_KillsTransfusionType:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 300 enemies with Transfusion grenades"

[LevelChallenges.Ash_ComDish ChallengeDefinition]
Description="Destroy all four communication dishes."

[LevelChallenges.Ash_KingMong ChallengeDefinition]
Description="Kill King Mong while he is slagged."

[LevelChallenges.Ash_SavetheTurrets ChallengeDefinition]
Description="Complete the fight at the gate before the loaders destroy the tower turrets."

[LevelChallenges.Cove_Warmong ChallengeDefinition]
ChallengeName="Midgemong Has No Friends"

[LevelChallenges.Dam_Couch ChallengeDefinition]
Description="Jump on all five couches in the Bloodshot Dam."

[LevelChallenges.Frost_Rodeo ChallengeDefinition]
Description="Stand on top of the Happy Pig Motel sign."

[LevelChallenges.Grass_Pit ChallengeDefinition]
Description="Kill a badass loader in the pit at the Hyperion Extraction Plant."

[LevelChallenges.Grass_Waterwheel ChallengeDefinition]
ChallengeName="Water Wheel... OF DEATH!"

[LevelChallenges.Lynchwood_DeathTrainDuel ChallengeDefinition]
Description="Duel another player on the Main Street train tracks."

[LevelChallenges.Lynchwood_TrainBandit ChallengeDefinition]
Description="Kill the bandit riding the five o'clock train."

[LevelChallenges.TundraExp_MadameVonBartlesby ChallengeDefinition]
Description="Kill Madame Von Bartlesby without any players taking damage from her bug bombs."

[LevelECHOChallenges.MapECHO_Zero ChallengeDefinition]
Description="Find out why Zer0 came to Pandora."

[Loot.Loot_OpenChests:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Open 5 treasure chests"

[Loot.Loot_OpenChests:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Open 25 treasure chests"

[Loot.Loot_OpenChests:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Open 50 treasure chests"

[Loot.Loot_OpenChests:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Open 125 treasure chests"

[Loot.Loot_OpenChests:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Open 250 treasure chests"

[Loot.Loot_OpenLootables ChallengeDefinition]
Description="Open lootable crates, lockers, and other objects."

[Loot.Loot_OpenLootables:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Open 50 lootable containers"

[Loot.Loot_OpenLootables:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Open 250 lootable containers"

[Loot.Loot_OpenLootables:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Open 750 lootable containers"

[Loot.Loot_OpenLootables:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Open 1,500 lootable containers"

[Loot.Loot_OpenLootables:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Open 2,500 lootable containers"

[Loot.Loot_PickUpWeapons:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Pick up or purchase 10 weapons"

[Loot.Loot_PickUpWeapons:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Pick up or purchase 25 weapons"

[Loot.Loot_PickUpWeapons:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Pick up or purchase 150 weapons"

[Loot.Loot_PickUpWeapons:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Pick up or purchase 300 weapons"

[Loot.Loot_PickUpWeapons:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Pick up or purchase 750 weapons"

[Melee.Melee_Kills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 25 enemies with melee attacks"

[Melee.Melee_Kills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 100 enemies with melee attacks"

[Melee.Melee_Kills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 400 enemies with melee attacks"

[Melee.Melee_Kills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 1,000 enemies with melee attacks"

[Melee.Melee_Kills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 2,000 enemies with melee attacks"

[Melee.Melee_KillsBladed:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 20 enemies with bladed weapon melee attacks"

[Melee.Melee_KillsBladed:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 75 enemies with bladed weapon melee attacks"

[Melee.Melee_KillsBladed:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 250 enemies with bladed weapon melee attacks"

[Melee.Melee_KillsBladed:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 600 enemies with bladed weapon melee attacks"

[Melee.Melee_KillsBladed:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 1,000 enemies with bladed weapon melee attacks"

[Miscellaneous.Misc_CompleteChallenges ChallengeDefinition]
ChallengeName="Yo Dawg, I Heard You Like Challenges"
Description="Complete many, many challenges."

[Miscellaneous.Misc_CompleteChallenges:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Complete 5 challenges"

[Miscellaneous.Misc_CompleteChallenges:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Complete 25 challenges"

[Miscellaneous.Misc_CompleteChallenges:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Complete 50 challenges"

[Miscellaneous.Misc_CompleteChallenges:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Complete 100 challenges"

[Miscellaneous.Misc_CompleteChallenges:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Complete 200 challenges"

[Miscellaneous.Misc_JimmyJenkins ChallengeDefinition]
Description="Find and eliminate Jimmy J3NKN5."

[Miscellaneous.Misc_JimmyJenkins:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill Jimmy J3NKN5"

[Miscellaneous.Misc_JimmyJenkins:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill Jimmy J3NKN5 3 times"

[Miscellaneous.Misc_JimmyJenkins:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill Jimmy J3NKN5 6 times"

[Miscellaneous.Misc_JimmyJenkins:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill Jimmy J3NKN5 10 times"

[Miscellaneous.Misc_JimmyJenkins:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill Jimmy J3NKN5 15 times"

[Miscellaneous.Missions_OptionalObjectivesCompleted:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Complete 10 optional objectives"

[Miscellaneous.Missions_OptionalObjectivesCompleted:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Complete 25 optional objectives"

[Miscellaneous.Missions_OptionalObjectivesCompleted:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Complete 45 optional objectives"

[Miscellaneous.Missions_OptionalObjectivesCompleted:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Complete 70 optional objectives"

[Miscellaneous.Missions_OptionalObjectivesCompleted:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Complete 100 optional objectives"

[Miscellaneous.Missions_SideMissionsCompleted:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Complete 5 side missions"

[Miscellaneous.Missions_SideMissionsCompleted:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Complete 15 side missions"

[Miscellaneous.Missions_SideMissionsCompleted:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Complete 30 side missions"

[Miscellaneous.Missions_SideMissionsCompleted:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Complete 55 side missions"

[Miscellaneous.Missions_SideMissionsCompleted:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Complete 90 side missions"

[Pickups.Inventory_PickupBlueItems ChallengeDefinition]
Description="Loot or purchase blue-rarity items."

[Pickups.Inventory_PickupBlueItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Loot or purchase 5 blue-rarity items"

[Pickups.Inventory_PickupBlueItems:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Loot or purchase 12 blue-rarity items"

[Pickups.Inventory_PickupBlueItems:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Loot or purchase 20 blue-rarity items"

[Pickups.Inventory_PickupBlueItems:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Loot or purchase 30 blue-rarity items"

[Pickups.Inventory_PickupBlueItems:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Loot or purchase 45 blue-rarity items"

[Pickups.Inventory_PickupGreenItems ChallengeDefinition]
Description="Loot or purchase green-rarity items."

[Pickups.Inventory_PickupGreenItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Loot or purchase 20 green-rarity items"

[Pickups.Inventory_PickupGreenItems:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Loot or purchase 50 green-rarity items"

[Pickups.Inventory_PickupGreenItems:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Loot or purchase 75 green-rarity items"

[Pickups.Inventory_PickupGreenItems:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Loot or purchase 125 green-rarity items"

[Pickups.Inventory_PickupGreenItems:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Loot or purchase 200 green-rarity items"

[Pickups.Inventory_PickupOrangeItems ChallengeDefinition]
Description="Loot or purchase legendary items."

[Pickups.Inventory_PickupOrangeItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Loot or purchase a legendary item"

[Pickups.Inventory_PickupOrangeItems:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Loot or purchase 3 legendary items"

[Pickups.Inventory_PickupOrangeItems:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Loot or purchase 6 legendary items"

[Pickups.Inventory_PickupOrangeItems:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Loot or purchase 10 legendary items"

[Pickups.Inventory_PickupOrangeItems:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Loot or purchase 15 legendary items"

[Pickups.Inventory_PickupPurpleItems ChallengeDefinition]
Description="Loot or purchase purple-rarity items."

[Pickups.Inventory_PickupPurpleItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Loot or purchase 2 purple-rarity items"

[Pickups.Inventory_PickupPurpleItems:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Loot or purchase 4 purple-rarity items"

[Pickups.Inventory_PickupPurpleItems:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Loot or purchase 7 purple-rarity items"

[Pickups.Inventory_PickupPurpleItems:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Loot or purchase 12 purple-rarity items"

[Pickups.Inventory_PickupPurpleItems:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Loot or purchase 20 purple-rarity items"

[Pickups.Inventory_PickupWhiteItems:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Loot or purchase 50 white-rarity items"

[Pickups.Inventory_PickupWhiteItems:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Loot or purchase 125 white-rarity items"

[Pickups.Inventory_PickupWhiteItems:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Loot or purchase 250 white-rarity items"

[Pickups.Inventory_PickupWhiteItems:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Loot or purchase 400 white-rarity items"

[Pickups.Inventory_PickupWhiteItems:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Loot or purchase 600 white-rarity items"

[Player.Player_CoopRevivesOfFriends:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Revive co-op partners 5 times"

[Player.Player_CoopRevivesOfFriends:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Revive co-op partners 10 times"

[Player.Player_CoopRevivesOfFriends:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Revive co-op partners 50 times"

[Player.Player_CoopRevivesOfFriends:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Revive co-op partners 100 times"

[Player.Player_CoopRevivesOfFriends:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Revive co-op partners 200 times"

[Player.Player_SecondWindFromBadass ChallengeDefinition]
Description="Get Second Winds by killing badass enemies."

[Player.Player_SecondWindFromBadass:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Get a Second Wind 5 times by killing a badass enemy"

[Player.Player_SecondWindFromBadass:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Get a Second Wind 15 times by killing a badass enemy"

[Player.Player_SecondWindFromBadass:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Get a Second Wind 30 times by killing a badass enemy"

[Player.Player_SecondWindFromBadass:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Get a Second Wind 50 times by killing a badass enemy"

[Player.Player_SecondWindFromCorrosive:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get a Second Wind by killing an enemy with Corrode damage"

[Player.Player_SecondWindFromCorrosive:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Get a Second Wind 5 times by killing an enemy with Corrode damage"

[Player.Player_SecondWindFromCorrosive:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Get a Second Wind 15 times by killing an enemy with Corrode damage"

[Player.Player_SecondWindFromCorrosive:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Get a Second Wind 30 times by killing an enemy with Corrode damage"

[Player.Player_SecondWindFromCorrosive:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Get a Second Wind 50 times by killing an enemy with Corrode damage"

[Player.Player_SecondWindFromFire ChallengeDefinition]
Description="Get Second Winds by killing enemies with an incendiary DoT (damage over time)."

[Player.Player_SecondWindFromFire:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get a Second Wind by killing an enemy with Burn damage"

[Player.Player_SecondWindFromFire:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Get a Second Wind 5 times by killing an enemy with Burn damage"

[Player.Player_SecondWindFromFire:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Get a Second Wind 15 times by killing an enemy with Burn damage"

[Player.Player_SecondWindFromFire:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Get a Second Wind 30 times by killing an enemy with Burn damage"

[Player.Player_SecondWindFromFire:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Get a Second Wind 50 times by killing an enemy with Burn damage"

[Player.Player_SecondWindFromShock ChallengeDefinition]
Description="Get Second Winds by killing enemies with a shock DoT (damage over time)."

[Player.Player_SecondWindFromShock:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get a Second Wind by killing an enemy with Electrocute damage"

[Player.Player_SecondWindFromShock:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Get a Second Wind 5 times by killing an enemy with Electrocute damage"

[Player.Player_SecondWindFromShock:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Get a Second Wind 15 times by killing an enemy with Electrocute damage"

[Player.Player_SecondWindFromShock:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Get a Second Wind 30 times by killing an enemy with Electrocute damage"

[Player.Player_SecondWindFromShock:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Get a Second Wind 50 times by killing an enemy with Electrocute damage"

[Shields.CUT_KillsNoShields:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 1,250 enemies while no shield is equipped"

[Shields.CUT_KillsNoShields:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 2,500 enemies while no shield is equipped"

[Shields.Shields_KillsRoid ChallengeDefinition]
Description="Kill enemies while buffed by a Maylay shield."

[Shields.Shields_KillsRoid:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 enemies while buffed by a Maylay shield"

[Shields.Shields_KillsRoid:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 enemies while buffed by a Maylay shield"

[Shields.Shields_KillsRoid:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 50 enemies while buffed by a Maylay shield"

[Shields.Shields_KillsRoid:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 100 enemies while buffed by a Maylay shield"

[Shields.Shields_KillsRoid:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 200 enemies while buffed by a Maylay shield"

[Shields.Shields_KillsSpikes:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 enemies with Spike shield damage"

[Shields.Shields_KillsSpikes:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 enemies with Spike shield damage"

[Shields.Shields_KillsSpikes:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 50 enemies with Spike shield damage"

[Shields.Shields_KillsSpikes:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 100 enemies with Spike shield damage"

[Shields.Shields_KillsSpikes:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 200 enemies with Spike shield damage"

[Vehicles.Vehicles_DriveMiles:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Drive 10 miles"

[Vehicles.Vehicles_DriveMiles:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Drive 50 miles"

[Vehicles.Vehicles_DriveMiles:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Drive 100 miles"

[Vehicles.Vehicles_DriveMiles:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Drive 250 miles"

[Vehicles.Vehicles_DriveMiles:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Drive 500 miles"

[Vehicles.Vehicles_KillByPowerSlide:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 enemies by power-sliding over them with a vehicle"

[Vehicles.Vehicles_KillByPowerSlide:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 15 enemies by power-sliding over them with a vehicle"

[Vehicles.Vehicles_KillByPowerSlide:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 30 enemies by power-sliding over them with a vehicle"

[Vehicles.Vehicles_KillByPowerSlide:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 50 enemies by power-sliding over them with a vehicle"

[Vehicles.Vehicles_KillByPowerSlide:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 75 enemies by power-sliding over them with a vehicle"

[Vehicles.Vehicles_KillByRamming:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 enemies by running them over"

[Vehicles.Vehicles_KillByRamming:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 10 enemies by running them over"

[Vehicles.Vehicles_KillByRamming:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 50 enemies by running them over"

[Vehicles.Vehicles_KillByRamming:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 100 enemies by running them over"

[Vehicles.Vehicles_KillByRamming:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 200 enemies by running them over"

[Vehicles.Vehicles_KillsWhilePassenger:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill an enemy while riding as a passenger"

[Vehicles.Vehicles_KillsWhilePassenger:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 10 enemies while riding as a passenger"

[Vehicles.Vehicles_KillsWhilePassenger:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 50 enemies while riding as a passenger"

[Vehicles.Vehicles_KillsWhilePassenger:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 100 enemies while riding as a passenger"

[Vehicles.Vehicles_KillsWhilePassenger:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 200 enemies while riding as a passenger"

[Vehicles.Vehicles_KillsWithVehicleWeapon:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies using a turret or vehicle-mounted weapon"

[Vehicles.Vehicles_KillsWithVehicleWeapon:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 25 enemies using a turret or vehicle-mounted weapon"

[Vehicles.Vehicles_KillsWithVehicleWeapon:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 150 enemies using a turret or vehicle-mounted weapon"

[Vehicles.Vehicles_KillsWithVehicleWeapon:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 300 enemies using a turret or vehicle-mounted weapon"

[Vehicles.Vehicles_KillsWithVehicleWeapon:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 750 enemies using a turret or vehicle-mounted weapon"

[Vehicles.Vehicles_VehicleKillsVehicle ChallengeDefinition]
ChallengeName="One Van Leaves"

[Vehicles.Vehicles_VehicleKillsVehicle:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 vehicles while in a vehicle"

[Vehicles.Vehicles_VehicleKillsVehicle:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 10 vehicles while in a vehicle"

[Vehicles.Vehicles_VehicleKillsVehicle:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 50 vehicles while in a vehicle"

[Vehicles.Vehicles_VehicleKillsVehicle:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 100 vehicles while in a vehicle"

[Vehicles.Vehicles_VehicleKillsVehicle:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 200 vehicles while in a vehicle"

[Weapons.AssaultRifle_CriticalHitKills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 10 crit-kills with assault rifles"

[Weapons.AssaultRifle_CriticalHitKills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 25 crit-kills with assault rifles"

[Weapons.AssaultRifle_CriticalHitKills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 75 crit-kills with assault rifles"

[Weapons.AssaultRifle_CriticalHitKills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 150 crit-kills with assault rifles"

[Weapons.AssaultRifle_CriticalHitKills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 300 crit-kills with assault rifles"

[Weapons.AssaultRifle_KillsCrouched:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 1,600 enemies with an assault rifle while crouched"

[Weapons.AssaultRifle_KillsCrouched:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 3,200 enemies with an assault rifle while crouched"

[Weapons.AssaultRifle_SecondWinds:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 5 Second Winds with assault rifles"

[Weapons.AssaultRifle_SecondWinds:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 15 Second Winds with assault rifles"

[Weapons.AssaultRifle_SecondWinds:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 30 Second Winds with assault rifles"

[Weapons.AssaultRifle_SecondWinds:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 50 Second Winds with assault rifles"

[Weapons.AssaultRifle_SecondWinds:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 75 Second Winds with assault rifles"

[Weapons.Launcher_KillsDirectHit:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 enemies with direct hits from a rocket launcher"

[Weapons.Launcher_KillsDirectHit:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 10 enemies with direct hits from a rocket launcher"

[Weapons.Launcher_KillsDirectHit:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 50 enemies with direct hits from a rocket launcher"

[Weapons.Launcher_KillsDirectHit:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 100 enemies with direct hits from a rocket launcher"

[Weapons.Launcher_KillsDirectHit:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 200 enemies with direct hits from a rocket launcher"

[Weapons.Launcher_KillsLongRange:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 25 enemies from long range using a rocket launcher"

[Weapons.Launcher_KillsLongRange:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 100 enemies from long range using a rocket launcher"

[Weapons.Launcher_KillsLongRange:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 400 enemies from long range using a rocket launcher"

[Weapons.Launcher_KillsLongRange:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 1,000 enemies from long range using a rocket launcher"

[Weapons.Launcher_KillsLongRange:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 2,000 enemies from long range using a rocket launcher"

[Weapons.Launcher_SecondWinds:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 2 Second Winds with rocket launchers"

[Weapons.Launcher_SecondWinds:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 5 Second Winds with rocket launchers"

[Weapons.Launcher_SecondWinds:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 15 Second Winds with rocket launchers"

[Weapons.Launcher_SecondWinds:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 30 Second Winds with rocket launchers"

[Weapons.Launcher_SecondWinds:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 50 Second Winds with rocket launchers"

[Weapons.Pistol_CriticalHitKills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 10 crit-kills with pistols"

[Weapons.Pistol_CriticalHitKills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 25 crit-kills with pistols"

[Weapons.Pistol_CriticalHitKills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 75 crit-kills with pistols"

[Weapons.Pistol_CriticalHitKills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 150 crit-kills with pistols"

[Weapons.Pistol_CriticalHitKills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 300 crit-kills with pistols"

[Weapons.Pistol_Kills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 25 kills with pistols"

[Weapons.Pistol_Kills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 100 kills with pistols"

[Weapons.Pistol_Kills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 400 kills with pistols"

[Weapons.Pistol_Kills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 1,000 kills with pistols"

[Weapons.Pistol_Kills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 2,000 kills with pistols"

[Weapons.Pistol_KillsQuickshot ChallengeDefinition]
Description="Kill enemies shortly after aiming down the sights with a pistol."

[Weapons.Pistol_KillsQuickshot:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies with a pistol just after aiming down sights"

[Weapons.Pistol_KillsQuickshot:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 25 enemies with a pistol just after aiming down sights"

[Weapons.Pistol_KillsQuickshot:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 150 enemies with a pistol just after aiming down sights"

[Weapons.Pistol_KillsQuickshot:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 300 enemies with a pistol just after aiming down sights"

[Weapons.Pistol_KillsQuickshot:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 750 enemies with a pistol just after aiming down sights"

[Weapons.Pistol_SecondWinds:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 2 Second Winds with pistols"

[Weapons.Pistol_SecondWinds:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 5 Second Winds with pistols"

[Weapons.Pistol_SecondWinds:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 15 Second Winds with pistols"

[Weapons.Pistol_SecondWinds:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 30 Second Winds with pistols"

[Weapons.Pistol_SecondWinds:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 50 Second Winds with pistols"

[Weapons.Rocket_KillsDirectHit:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 1,250 enemies with direct hits from launcher projectiles"

[Weapons.Shotgun_CriticalHitKills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 10 crit-kills with shotguns"

[Weapons.Shotgun_CriticalHitKills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 50 crit-kills with shotguns"

[Weapons.Shotgun_CriticalHitKills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 100 crit-kills with shotguns"

[Weapons.Shotgun_CriticalHitKills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 250 crit-kills with shotguns"

[Weapons.Shotgun_CriticalHitKills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 500 crit-kills with shotguns"

[Weapons.Shotgun_KillsLongRange:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies at long range with shotguns"

[Weapons.Shotgun_KillsLongRange:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 25 enemies at long range with shotguns"

[Weapons.Shotgun_KillsLongRange:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 75 enemies at long range with shotguns"

[Weapons.Shotgun_KillsLongRange:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 150 enemies at long range with shotguns"

[Weapons.Shotgun_KillsLongRange:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 300 enemies at long range with shotguns"

[Weapons.Shotgun_KillsPointBlank ChallengeDefinition]
Description="Kill enemies at point-blank range with shotguns."

[Weapons.Shotgun_KillsPointBlank:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 10 enemies at point blank range with shotguns"

[Weapons.Shotgun_KillsPointBlank:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Kill 25 enemies at point blank range with shotguns"

[Weapons.Shotgun_KillsPointBlank:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Kill 150 enemies at point blank range with shotguns"

[Weapons.Shotgun_KillsPointBlank:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Kill 300 enemies at point blank range with shotguns"

[Weapons.Shotgun_KillsPointBlank:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Kill 750 enemies at point blank range with shotguns"

[Weapons.Shotgun_SecondWinds ChallengeDefinition]
ChallengeName="Lock, Stock, and..."

[Weapons.Shotgun_SecondWinds:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 2 Second Winds with shotguns"

[Weapons.Shotgun_SecondWinds:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 5 Second Winds with shotguns"

[Weapons.Shotgun_SecondWinds:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 15 Second Winds with shotguns"

[Weapons.Shotgun_SecondWinds:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 30 Second Winds with shotguns"

[Weapons.Shotgun_SecondWinds:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 50 Second Winds with shotguns"

[Weapons.SMG_CriticalHitKills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 10 crit-kills with SMGs"

[Weapons.SMG_CriticalHitKills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 25 crit-kills with SMGs"

[Weapons.SMG_CriticalHitKills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 75 crit-kills with SMGs"

[Weapons.SMG_CriticalHitKills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 150 crit-kills with SMGs"

[Weapons.SMG_CriticalHitKills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 300 crit-kills with SMGs"

[Weapons.SMG_CriticalHits:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Score 25 critical hits with SMGs"

[Weapons.SMG_CriticalHits:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Score 100 critical hits with SMGs"

[Weapons.SMG_CriticalHits:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Score 400 critical hits with SMGs"

[Weapons.SMG_CriticalHits:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Score 1,000 critical hits with SMGs"

[Weapons.SMG_CriticalHits:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Score 2,000 critical hits with SMGs"

[Weapons.SMG_Kills:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 25 kills with SMGs"

[Weapons.SMG_Kills:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 100 kills with SMGs"

[Weapons.SMG_Kills:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 400 kills with SMGs"

[Weapons.SMG_Kills:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 1,000 kills with SMGs"

[Weapons.SMG_Kills:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 2,000 kills with SMGs"

[Weapons.SMG_SecondWinds:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 2 Second Winds with SMGs"

[Weapons.SMG_SecondWinds:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 5 Second Winds with SMGs"

[Weapons.SMG_SecondWinds:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 15 Second Winds with SMGs"

[Weapons.SMG_SecondWinds:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 30 Second Winds with SMGs"

[Weapons.SMG_SecondWinds:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 50 Second Winds with SMGs"

[Weapons.Sniper_CriticalHits:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Get 25 critical hits with sniper rifles"

[Weapons.Sniper_CriticalHits:ChallengeConditionDefinition_1 ChallengeConditionDefinition]
Description="Get 100 critical hits with sniper rifles"

[Weapons.Sniper_CriticalHits:ChallengeConditionDefinition_2 ChallengeConditionDefinition]
Description="Get 400 critical hits with sniper rifles"

[Weapons.Sniper_CriticalHits:ChallengeConditionDefinition_3 ChallengeConditionDefinition]
Description="Get 1,000 critical hits with sniper rifles"

[Weapons.Sniper_CriticalHits:ChallengeConditionDefinition_4 ChallengeConditionDefinition]
Description="Get 2,000 critical hits with sniper rifles"

[Weapons.SniperRifle_KillsFromHip ChallengeDefinition]
Description="Kill enemies with sniper rifles without using the scope/ironsights."

[Weapons.SniperRifle_KillsFullShieldEnemy:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 shielded enemies in one shot using sniper rifles"

[Weapons.SniperRifle_KillsFullShieldEnemy:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 15 shielded enemies in one shot using sniper rifles"

[Weapons.SniperRifle_KillsFullShieldEnemy:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 35 shielded enemies in one shot using sniper rifles"

[Weapons.SniperRifle_KillsFullShieldEnemy:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 75 shielded enemies in one shot using sniper rifles"

[Weapons.SniperRifle_KillsFullShieldEnemy:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 125 shielded enemies in one shot using your sniper rifle"

[Weapons.SniperRifle_KillsUnaware:ChallengeConditionDefinition_0 ChallengeConditionDefinition]
Description="Kill 5 unaware enemies using sniper rifles"

[Weapons.SniperRifle_KillsUnaware:ChallengeConditionDefinition_5 ChallengeConditionDefinition]
Description="Kill 10 unaware enemies using sniper rifles"

[Weapons.SniperRifle_KillsUnaware:ChallengeConditionDefinition_6 ChallengeConditionDefinition]
Description="Kill 50 unaware enemies using sniper rifles"

[Weapons.SniperRifle_KillsUnaware:ChallengeConditionDefinition_7 ChallengeConditionDefinition]
Description="Kill 100 unaware enemies using sniper rifles"

[Weapons.SniperRifle_KillsUnaware:ChallengeConditionDefinition_8 ChallengeConditionDefinition]
Description="Kill 200 unaware enemies using sniper rifles"

